CATEGORIES = {
    "Кафе": (
        "кофе",
        "латте",
        "капучино",
        "раф",
        "чай",
        "бургер",
        "пицца",
        "суши",
        "роллы",
        "ресторан",
        "кафе",
    ),

    "Продукты": (
        "магнит",
        "пятерочка",
        "пятёрочка",
        "лента",
        "ашан",
        "спар",
        "перекресток",
        "перекрёсток",
        "вкусвилл",
        "продукты",
    ),

    "Транспорт": (
        "такси",
        "автобус",
        "метро",
        "бензин",
        "азс",
    ),

    "Красота": (
        "маникюр",
        "шугаринг",
        "парикмахер",
        "ресницы",
        "брови",
        "косметика",
    ),

    "Дом": (
        "интернет",
        "квартира",
        "аренда",
        "коммуналка",
    ),

    "Здоровье": (
        "аптека",
        "лекарство",
        "врач",
        "анализы",
    ),

    "Питомцы": (
        "кот",
        "корм",
        "наполнитель",
        "ветеринар",
        "зоомагазин",
    ),

    "Подарки": (
        "подарок",
        "подарки",
    ),

    "WB": (
        "вб",
        "wb",
        "wildberries",
        "вайлдберриз",
    ),

    "Тренировки": (
        "зал",
        "тренировка",
        "фитнес",
        "спорт",
    ),

    "Авто": (
        "машина",
        "авто",
        "мойка",
        "заправка",
        "ремонт",
    ),
}


CATEGORY_ICONS = {
    "Кафе": "☕",
    "Продукты": "🛒",
    "Транспорт": "🚕",
    "Красота": "💅",
    "Дом": "🏠",
    "Здоровье": "💊",
    "Питомцы": "🐱",
    "Подарки": "🎁",
    "WB": "🛍",
    "Тренировки": "🏋️",
    "Авто": "🚗",
}
CUSTOM_CATEGORY_ICONS = {
    "Авто": "🚗",
    "Одежда": "👗",
    "Техника": "🔧",
    "Питомцы": "🐱",
    "Подарки": "🎁",
    "Красота": "💅",
    "Дом": "🏠",
    "Еда": "🍽",
    "Хобби": "🎨",
    "Книги": "📚",
    "Учёба": "📖",
}
